[
    { "Code": "CS101", "Name": "Introduction to Programming", "Description": "Learn the fundamentals of programming using a high-level language. Topics include variables, loops, and functions." },
    { "Code": "MATH101", "Name": "Calculus I", "Description": "An introduction to differential and integral calculus, focusing on limits, derivatives, and integrals." },
    { "Code": "ENG102", "Name": "English Literature", "Description": "A survey of English literature, including major works from different literary periods." },
    { "Code": "BIO101", "Name": "Introduction to Biology", "Description": "An introductory course on the basics of biology, including cell structure, genetics, and evolution." },
    { "Code": "CHEM101", "Name": "General Chemistry", "Description": "Study of chemical principles including atomic structure, bonding, and stoichiometry." },
    { "Code": "PHYS101", "Name": "Physics I", "Description": "Basic concepts of mechanics, energy, and motion, with applications to real-world problems." },
    { "Code": "CS201", "Name": "Data Structures", "Description": "Introduction to common data structures such as arrays, stacks, queues, and linked lists." },
    { "Code": "MATH201", "Name": "Calculus II", "Description": "Continuation of Calculus I, focusing on techniques of integration, series, and multivariable calculus." },
    { "Code": "ENG201", "Name": "Shakespearean Drama", "Description": "In-depth study of the works of William Shakespeare, analyzing major plays and their themes." },
    { "Code": "BIO201", "Name": "Human Anatomy", "Description": "Study of the human body, including the skeletal, muscular, circulatory, and nervous systems." },
    { "Code": "CHEM201", "Name": "Organic Chemistry", "Description": "Introduction to the structure, properties, and reactions of organic compounds and materials." },
    { "Code": "PHYS201", "Name": "Electromagnetism", "Description": "Study of electric fields, magnetic fields, and electromagnetic waves, including their interactions with matter." },
    { "Code": "CS301", "Name": "Algorithms", "Description": "Study of algorithms, including sorting, searching, and optimization techniques." },
    { "Code": "MATH301", "Name": "Linear Algebra", "Description": "Introduction to matrices, vector spaces, and linear transformations." },
    { "Code": "ENG302", "Name": "Modern World Literature", "Description": "Exploration of modern literature, focusing on authors from the 20th and 21st centuries." },
    { "Code": "BIO301", "Name": "Genetics", "Description": "Study of inheritance, gene expression, and molecular biology." },
    { "Code": "CHEM301", "Name": "Physical Chemistry", "Description": "Study of the principles of thermodynamics, kinetics, and quantum chemistry." },
    { "Code": "PHYS301", "Name": "Quantum Mechanics", "Description": "Introduction to the principles of quantum theory, including wave functions and quantum states." },
    { "Code": "CS401", "Name": "Operating Systems", "Description": "Study of the fundamental concepts of operating systems, including processes, memory management, and file systems." },
    { "Code": "MATH401", "Name": "Probability and Statistics", "Description": "Introduction to probability theory, random variables, distributions, and statistical inference." },
    { "Code": "ENG401", "Name": "Rhetoric and Composition", "Description": "Focus on writing skills and effective argumentation in various forms of discourse." },
    { "Code": "BIO401", "Name": "Ecology", "Description": "Study of ecosystems, environmental factors, and the interactions between organisms and their environments." },
    { "Code": "CHEM401", "Name": "Biochemistry", "Description": "Introduction to the chemical processes within living organisms, including metabolism and enzyme function." },
    { "Code": "PHYS401", "Name": "Astrophysics", "Description": "Study of the physical properties of celestial bodies, including stars, planets, and galaxies." },
    { "Code": "CS402", "Name": "Software Engineering", "Description": "Introduction to software development, including the software development lifecycle, methodologies, and design patterns." },
    { "Code": "MATH402", "Name": "Discrete Mathematics", "Description": "Study of mathematical structures that are fundamentally discrete rather than continuous, such as graphs and combinatorics." }
]